In [1]:
import pandas as pd

In [4]:
lst = [1,2,3,4,5,6]
series =pd.Series(lst)
print(series)

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [2]:
df = pd.DataFrame(
    {
        "Name":["Abdul","Samad","Chandio"],
        "Age":[20,22,24],
        "Sex":["Male","Male","Female"]
    }
)

df

      Name  Age     Sex
0    Abdul   20    Male
1    Samad   22    Male
2  Chandio   24  Female